<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"50d8b5ae73a75a97c5563ae77dd76ba343a868f1d94b4a1c44000c1815f4c6c7","plan_job_ref":"Job Write Terraform Plan to Pull Request #55 at https://github.com/hackforla/devops-security/actions/runs/10482035873","plan_out_hash":"15140f24a9507e3f909424bf824f7bbefc1c791354a8bfe74760f2642347af89","plan_hash":"c832f628a62fa7c5e5148fcfeddf23ac2e01e7292291bdb7e00f547147020bb4","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.iam_user_npang4.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "npang4"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_npang4.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "npang4"
    }

  # module.iam_user_npang4.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "npang4"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #55](https://github.com/hackforla/devops-security/actions/runs/10482035873)